app/controllers/channels_controller.rb

SELECT * FROM `channels` WHERE (`channels`.`name` = 'patata') LIMIT 1
UPDATE `channels` SET `views` = 1, `updated_at` = '2011-12-12 17:48:53' WHERE `id` = 1
SELECT * FROM `videos` WHERE (`videos`.channel_id = 1 AND (NOT live)) ORDER BY created_at DESC LIMIT 0, 2
SELECT count(*) AS count_all FROM `videos` WHERE (NOT live) AND (`videos`.channel_id = 1)
---
  def show
    @channel = Channel.find_by_name(params[:id])
    if @channel
      # Incrementa el contador de visitas
      @channel.views += 1
      @channel.save
      # Saca los datos de video online y videos emitidos
      condiciones = ["NOT live"]
      if current_channel != @channel
        puts "------------> Queremos mirar solo los publicos"
        condiciones += ["public"]
      end
      @video_live = @channel.videos.first( :conditions => { :live => true })
      @videos = @channel.videos.paginate( :order => 'created_at DESC', :conditions => condiciones, :page => 1, :per_page => 3 )

SELECT * FROM `channels` WHERE (`channels`.`id` = '1') LIMIT 1
SELECT * FROM `videos` WHERE (`videos`.channel_id = 1 AND (NOT live)) ORDER BY created_at DESC LIMIT 2, 2
SELECT count(*) AS count_all FROM `videos` WHERE (NOT live) AND (`videos`.channel_id = 1)
---
  def mas_videos
    channel = Channel.find_by_id(params[:id])
    condiciones = ["NOT live"]
    if current_channel != channel
        puts "------------> Queremos mirar solo los publicos"
      condiciones += ["public"]
    end
    @videos = channel.videos.paginate( :order => 'created_at DESC', :conditions => condiciones, :page => params[:page], :per_page => 3 )

UPDATE `channels` SET `updated_at` = '2011-12-08 01:25:27', `stream_token` = '1a8257996ed551b81f00fec8ddbedbad' WHERE `id` = 1
---
  def show_xml
    @channel.stream_token = Digest::MD5.hexdigest(Time.now.to_s)
    @channel.save

INSERT INTO `channels` (`name`, `created_at`, `crypted_password`, `updated_at`, `views`, `password_salt`, `persistence_token`, `description`, `stream_token`, `email`) VALUES('pruebas', '2011-12-12 17:48:24', '60972ada76ce7d0cdf912d931c5bfa5ec2de07e19b577b81e88451ef495b44d9a8b0c851bd9ec5f629f6008b793ebdb1e3fe7d2a2261dea257c2fc6e8850af7a', '2011-12-12 17:48:24', 0, 'yE5N79MMKavsxaetqEh', '0c0859a8e308017c095719f0a1b3103a4085c8805719198469e6eb21a529383a86046af9a8a21e8e0ed36fcf6da6fe8ebbb16beb4d0a03f9f253c291177e8245', 'Este es el canal de pruebas', NULL, 'kk@kk.com')
---
  def create
    @channel = Channel.new(params[:channel])
    if @channel.save

UPDATE `channels` SET `updated_at` = '2011-12-07 22:49:40', `stream_token` = '5b2f095c11ee28e0032ad4f03808c97c', `description` = 'Este es el canal de pruebas' WHERE `id` = 1
---
  def update
    if @channel.update_attributes(params[:channel])