app/controllers/home_controller.rb

  def index
    @channels = Channel.all
---
SELECT * FROM `channels`