app/controllers/videos_controller.rb

  def show
    @video = Video.find_by_id(params[:id])
---
SELECT * FROM `videos` WHERE (`videos`.`id` = '15') LIMIT 1

  def delete
    video = Video.find_by_id(params[:id])
    video.delete
---
SELECT * FROM `videos` WHERE (`videos`.`id` = '7') LIMIT 1
DELETE FROM `videos` WHERE (`id` IN (7))